{
  "id": "abb0e23940ef",
  "title": "Congressman Langworthy Announces Over $5.1 Million Pipeline Safety Grant for New York",
  "date": "August 29, 2025",
  "url": "https://langworthy.house.gov/media/press-releases/congressman-langworthy-announces-over-51-million-pipeline-safety-grant-new",
  "snippet": "Clarence, N.Y.— Congressman Nick Langworthy today announced that the U.S. Department of Transportation’s Pipeline and Hazardous Materials Safety Administration (PHMSA) has awarded the New York Departm",
  "full_text": "August 29, 2025\nPress Release\nClarence, N.Y.\n— Congressman Nick Langworthy today announced that the U.S. Department of Transportation’s Pipeline and Hazardous Materials Safety Administration (PHMSA) has awarded the New York Department of Public Service\n$5,156,215\nthrough its State Pipeline Safety Base Grant program.\nThis funding reimburses up to 80 percent of the operating costs for New York’s natural gas pipeline inspection and enforcement program, which ensures the safety and reliability of transmission and distribution pipelines across the state.\nCongressman Langworthy praised the award, saying:\n\"This grant is another clear demonstration of federal investment and support for natural gas as a clean, reliable, and safe form of energy. I am fighting to pass my legislation, the Energy Choice Act, to stop Kathy Hochul from her January 1, 2026 ban on natural gas and propane in all new home construction and new commercial construction under 10 stories.\nNatural gas is essential to New York’s energy security and economic competitiveness, and ensuring the safety of our pipeline infrastructure is key to protecting communities while meeting growing energy needs. I will continue to fight for policies that recognize the critical role natural gas plays in powering our homes, businesses, and future.”\nPHMSA’s State Pipeline Safety Base Grant program funds state inspectors, equipment, and enforcement activities to strengthen oversight of pipeline systems and ensure compliance with both state and federal safety standards. Congressman Nick Langworthy serves on the Energy and Commerce Committee, and represents New York’s 23\nrd\nCongressional District which includes part or all of the counties of Niagara, Erie, Chautauqua, Cattaraugus, Allegany, Steuben, Chemung, Schuyler,and Tioga.\n###\nIssues\n:\nGrant Announcements",
  "source": "congressional_website",
  "source_type": "press_release",
  "collected_date": "2025-12-21T14:03:45.527232",
  "verification_status": "pending",
  "archived_url": null,
  "flags": []
}