{
  "id": "ba4d40675271",
  "title": "Congressman Langworthy’s Landmark Energy Choice Act Passes Out of House Energy Subcommittee",
  "date": "November 19, 2025",
  "url": "https://langworthy.house.gov/media/press-releases/congressman-langworthys-landmark-energy-choice-act-passes-out-house-energy-0",
  "snippet": "WASHINGTON, D.C. — Congressman Nick Langworthy announced today that his landmark Energy Choice Act has officially passed out of the House Energy Subcommittee — a major victory for New Yorkers and a cr",
  "full_text": "November 19, 2025\nPress Release\nA Major Step Toward Stopping Hochul’s Natural Gas Ban, Protecting Americans’ Energy Choices & Pocketbooks\nWASHINGTON, D.C. — Congressman Nick Langworthy announced today that his landmark Energy Choice Act has officially passed out of the House Energy Subcommittee — a major victory for New Yorkers and a critical step toward blocking Governor Kathy Hochul’s natural gas ban in homes and businesses across the state.\nCongressman Langworthy’s bill, which prohibits state and local governments from banning certain sources of energy and safeguards Americans’ freedom to choose the most affordable and reliable energy sources for their families, advanced with strong support and now heads to the full Energy & Commerce Committee for consideration.\n“Banning natural gas in New York is one of the most reckless and clueless policies ever pushed on working families,” said Congressman Nick Langworthy. “It rips away an affordable, reliable energy source and replaces it with higher costs, weaker grids, and winter blackouts waiting to happen. It’s dangerous, it’s out of touch, and it’s going to have a cataclysmic effect on our energy supply, economy, and New Yorkers’ budgets. I’m so pleased that my Energy Choice Act has garnered incredible support, but we must keep this momentum going to get it passed and signed into law.”\nHochul’s proposed ban would prohibit natural gas in new construction-- a move that independent analysts warn could dramatically raise costs during already crippling home-energy price spikes. Langworthy’s legislation ensures that no state can force its residents into costly, unstable, or unproven energy mandates that put ideology ahead of affordability and reliability.\nThe Energy Choice Act has received widespread support from across New York State and the nation, just surpassing 200 local governments that have passed resolutions in support, 124 co-sponsors in the House from dozens of states and garnered endorsements from key industry stakeholders.\nCongressman Langworthy noted Hochul’s cynical attempt to use the court case to delay the ban until after the election, just as she did with congestion pricing. He continued, “There is zero doubt that after the election, Governor Hochul will pull the rug out from New Yorkers and implement her law—that’s why it’s more important than ever to pass my Energy Choice Act to ensure that New Yorkers have federal protections against this radical, dangerous ban. New York is already on its knees facing the worst affordability crisis in the nation—this would send us off the cliff with no return.”\nThe bill is being sponsored in the Senate by U.S. Senator Jim Justice of West Virginia.\nSupporting Organizations:\nAmerican Exploration and Production Council (AXPC)\nAmerican Gas Association (AGA)\nAmerican Petroleum Institute (API)\nAmerican Public Gas Association (APGA)\nAmericans for Prosperity (AFP)\nConcerned Veterans for America (CVA)\nConsumer Energy Alliance (CEA)\nEnergy Marketers of America (EMA)\nGPA Midstream Association\nGPSA Midstream Suppliers, Hearth\nPatio & Barbecue Association (HPBA)\nInterstate Natural Gas Association of America (INGAA)\nThe LIBRE Initiative\nNational Association of Home Builders (NAHB)\nNational Association of Oil and Energy Service Professionals (OESP)\nNational Energy and Fuels Institute (NEFI)\nNational Hispanic Energy Council\nNational Propane Gas Association (NPGA)\nPlumbing Heating Cooling Contractors – National Association (PHCC)\nPool & Hot Tub Alliance (PHTA)\nNational Ocean Industries Association (NOIA)\nEnergy Workforce and Technology Council\nPellet Fuel Institute\nAtmos Energy\nAmerican Supply Association (ASA)\nAmerica First Policy Institute (AFPI)\nFertilizer Institute\nU.S. Chamber of Commerce\nNational Federation of Independent Businesses (NFIB)\nInstitute for Legislative Analysis\nIndustrial Energy Consumers of America (IECA)\nClean Fuels Alliance\nBaker Commodities\nDigital Energy Council\nAmerican Fuel and Petrochemical Manufacturers\nIndependent Petroleum Association of America\nNational Gas Supply Association\n###\nIssues\n:\nEnergy",
  "source": "congressional_website",
  "source_type": "press_release",
  "collected_date": "2025-12-21T14:03:44.855984",
  "verification_status": "pending",
  "archived_url": null,
  "flags": []
}