{
  "id": "063beaa96292",
  "title": "Congressman Nick Langworthy Announces More Than $9.5 Million in FEMA Disaster Recovery Funding for Steuben County",
  "date": "August 25, 2025",
  "url": "https://langworthy.house.gov/media/press-releases/congressman-nick-langworthy-announces-more-95-million-fema-disaster-recovery",
  "snippet": "Steuben County, NY– Congressman Nick Langworthy today announced that the Federal Emergency Management Agency (FEMA) has awarded more than $9.5 million in federal disaster recovery funding for critical",
  "full_text": "August 25, 2025\nPress Release\nSteuben County, NY\n– Congressman Nick Langworthy today announced that the Federal Emergency Management Agency (FEMA) has awarded more than $9.5 million in federal disaster recovery funding for critical infrastructure and community repairs in Steuben County. The funding will support the Jasper-Troupsburg Central School District, the Steuben County Department of Public Works, and the Town of Cameron\n,\nall of which sustained significant damage from recent severe storms.\n“I am proud to announce that more than $9.5 million in FEMA funding is coming to Steuben County to help our communities recover and rebuild,” said\nCongressman Nick Langworthy\n. “When I traveled through Steuben County after Tropical Storm Debby, I saw firsthand the devastation that storm left behind, and I will continue to fight for the resources and support my constituents deserve. These federal investments will ease the burden on local taxpayers while ensuring that our schools, roads, and infrastructure remain strong and resilient.\n“Jasper-Troupsburg Central School District will receive the support it needs to clean up the damage from those terrible flash floods without placing a heavy financial strain on local families. Steuben County will receive more than $3.6 million to restore County Route 129 back to full service. And the Town of Cameron will finally have the resources to restore and reopen McMaster Road, which has been closed since the damage from Tropical Storm Fred in 2021.\n“I will always fight to make sure our communities get the support they need and deserve, and I am proud to see that hard work paying off today.”\nSteuben County Department of Public Works\n–\n$3,617,003.17\nSevere flooding from Tropical Storm Fred in August 2021 caused major damage to County Route 129 in Woodhull, including roadway washouts, guardrail failures, and a collapsed retaining wall. FEMA funding will allow the county to fully restore the road and supporting infrastructure to pre-disaster condition, ensuring the safety of residents and emergency services. This is a 90% federal cost share, and will serve as a major lift for local taxpayers\nJasper-Troupsburg Central School District\n–\n$2,946,315.09\nThe Jasper-Troupsburg Middle/High School was inundated with floodwaters during Tropical Storm Debby in August 2024. FEMA funding will reimburse the district for emergency protective measures, including pumping, debris removal, mold remediation, sanitizing, installation of dehumidification systems, and other health and safety protections. This is a 75% federal cost share, greatly easing the cost of prevention and cleanup.\nTown of Cameron\n–\n$2,973,346.56\nUnder Tropical Storm Fred, McMaster Road in Cameron suffered extensive damage across seven separate segments, including slope failures, culvert damage, and washed-out shoulders. FEMA funding will go toward restoration of the roadway and fund hazard mitigation measures, such as larger culverts and check dams, to strengthen the road against future flooding and erosion. This is a 90% federal cost share, and a huge tax relief for the Town of Cameron.\nIn total, Steuben County is receiving $9,536,664.82 in federal funding through FEMA’s Public Assistance Program. These awards are authorized under the Robert T. Stafford Disaster Relief and Emergency Assistance Act.\n###\nIssues\n:\nGrant Announcements",
  "source": "congressional_website",
  "source_type": "press_release",
  "collected_date": "2025-12-21T14:03:50.074154",
  "verification_status": "pending",
  "archived_url": null,
  "flags": []
}