{
  "id": "b4301dceca09",
  "title": "Congressman Nick Langworthy Joins Lockport Town Supervisor Crocker and the Town Board for Work Session to Address Energy Choice Act and the States’ War on Natural Gas & Propane",
  "date": "August 29, 2025",
  "url": "https://langworthy.house.gov/media/press-releases/congressman-nick-langworthy-joins-lockport-town-supervisor-crocker-and-town",
  "snippet": "Washington, D.C.– Congressman Nick Langworthy (NY-23) participated in the Lockport Town Board’s work session this week, where he joined Supervisor Crocker and the Town Board to discuss the urgent chal",
  "full_text": "August 29, 2025\nPress Release\nWashington, D.C.\n– Congressman Nick Langworthy (NY-23) participated in the Lockport Town Board’s work session this week, where he joined Supervisor Crocker and the Town Board to discuss the urgent challenges facing the community. The discussion centered on the harmful effects of Governor Hochul’s ban on natural gas and propane in new home construction, which Congressman Langworthy’s\nEnergy Choice Act\nwould repeal, as well as the burdensome state wetland regulations impacting development in Lockport.\n“I was honored to join the Lockport Town Board to talk about the issues that directly impact our community,”\nsaid Congressman Langworthy.\n“I outlined how my Energy Choice Act will put an end to Governor Hochul’s reckless and costly bans on natural gas and propane, restoring choice and affordability for families. It was clear in our conversation that there is strong agreement these mandates from Albany are out of touch and must be stopped. I want to thank Supervisor Mark Crocker and the entire board for inviting me to be part of this important discussion.”\n###\nIssues\n:\nEnergy",
  "source": "congressional_website",
  "source_type": "press_release",
  "collected_date": "2025-12-21T14:03:47.123763",
  "verification_status": "pending",
  "archived_url": null,
  "flags": []
}