{
  "id": "964942cfa0d3",
  "title": "Congressman Nick Langworthy Blasts Hochul’s Radical Energy Ban, Highlights Growing Momentum for His Energy Choice Act in Erie and Cattaraugus Counties",
  "date": "August 27, 2025",
  "url": "https://langworthy.house.gov/media/press-releases/congressman-nick-langworthy-blasts-hochuls-radical-energy-ban-highlights",
  "snippet": "Washington, D.C. –Congressman Nick Langworthy (NY-23) on Tuesday hosted press conferences at new-construction home sites in Erie and Cattaraugus Counties to spotlight the urgent need for hisEnergy Cho",
  "full_text": "August 27, 2025\nPress Release\nWashington, D.C. –\nCongressman Nick Langworthy (NY-23) on Tuesday hosted press conferences at new-construction home sites in Erie and Cattaraugus Counties to spotlight the urgent need for his\nEnergy Choice Act\n—legislation to stop extreme Democrat-led energy bans that threaten affordable, reliable options for families and businesses.\nGovernor Kathy Hochul and Albany Democrats are forcing a ban on natural gas in new construction across New York, a reckless policy that will drive up energy costs for working families, jeopardize reliable power in extreme weather, and strip New Yorkers of the right to choose how they heat and power their homes. The\nEnergy Choice Act\ndirectly pushes back on these mandates by prohibiting states and local governments from blocking energy service connections, modifications, or installations based on fuel source.\n“I am proud to lead the fight to ban the bans and defend New Yorkers’ right to affordable, reliable energy,”\nsaid Congressman Langworthy.\n“Hochul’s radical agenda will not only drive-up costs for families already struggling, but also eliminate a safe, dependable energy source that keeps homes heated and people protected. This is becoming a dangerous trend in blue states across the country, and my Energy Choice Act will end these costly bans, safeguard consumer choice, and secure America’s energy future.”\nWatch the Erie County live stream here.\nWatch the Cattaraugus County live stream here.\nClick here\nfor more photos.\nLangworthy was joined in strong opposition to Hochul’s energy ban by the Western New York and State\nHome Builders Association, and the National as well as regional Buffalo Niagara Realtors Association in Erie County. In Cattaraugus John Healy representing the\nBuilders Exchange of the Southern Tier and our host Nick Ferrari developer and owner of Field of Dreams also strongly support Congressman Langworthy’s Legislation, underscoring broad support from key industries who know firsthand the devastating impact these policies will have on families and the housing market.\n###\nIssues\n:\nNew York State\nEnergy",
  "source": "congressional_website",
  "source_type": "press_release",
  "collected_date": "2025-12-21T14:03:47.970702",
  "verification_status": "pending",
  "archived_url": null,
  "flags": []
}