{
  "id": "d0a163b667a5",
  "title": "CONGRESSMAN LANGWORTHY’S LEGISLATION TO BLOCK HOCHUL’S GAS BAN PASSES OUT OF ENERGY AND COMMERCE COMMITTEE",
  "date": "December 5, 2025",
  "url": "https://langworthy.house.gov/media/press-releases/congressman-langworthys-legislation-block-hochuls-gas-ban-passes-out-energy",
  "snippet": "WASHINGTON, D.C.– Congressman Nick Langworthy (NY-23) announced today that his legislation, theEnergy Choice Act, has passed out of the House Energy and Commerce Committee, clearing the final hurdle f",
  "full_text": "December 5, 2025\nPress Release\nEnergy Choice Act Clears Final Hurdle Before Heading to House Floor\nWASHINGTON, D.C.\n– Congressman Nick Langworthy (NY-23) announced today that his legislation, the\nEnergy Choice Act\n, has passed out of the House Energy and Commerce Committee, clearing the final hurdle for the bill to come before the full U.S. House of Representatives. The bill passed out of the Energy Subcommittee last week and support has grown to 140 bipartisan co-sponsors from across the country.\nThe Energy Choice Act (H.R.3699) prohibits states and local governments from banning an energy service's connection, reconnection, modification, installation, or expansion based on the type or source of energy to be delivered. Congressman Langworthy, who serves as a member of the House Energy and Commerce Committee, and as a member of the Energy and Environment subcommittees, has made protecting Americans’ energy options a top priority.\nCongressman Langworthy has been traveling across New York’s 23\nrd\nCongressional District to meet with homeowners and businesses about Governor Hochul’s looming statewide natural gas and propane ban, and the disastrous effect it will have on energy costs, access, and reliability.\nThe Energy Choice Act has been gaining significant momentum across the state of New York, with more than 200 local governments passing resolutions in support of the legislation. It has also garnered the support of dozens of industry stakeholders. The companion bill is being carried by U.S. Senator Jim Justice of West Virginia.\n“Today marks a huge step forward in my fight to protect New Yorkers’ access to affordable, reliable energy options,” said Congressman Nick Langworthy. “Advancing this bill out of committee means we can bring this bill before the full House where it has bipartisan support from both Republicans and common-sense Democrats. Albany’s war on natural gas is an illogical, dangerous infringement on your rights, your pocketbooks, and your safety. I’m proud to lead this fight and I won’t stop until we get this bill on the President’s desk for his signature.”\nNoting Hochul’s move to delay implementation until next year, Congressman Langworthy concluded, “Kathy Hochul is simply trying to buy time to avoid the political fallout that will come from her disastrous law, but make no mistake: if we don’t stop her at the federal level, this will soon be every New Yorker’s nightmare.”\nSupporting Organizations:\nAmerican Exploration and Production Council (AXPC)\nAmerican Gas Association (AGA)\nAmerican Petroleum Institute (API)\nAmerican Public Gas Association (APGA)\nAmericans for Prosperity (AFP)\nConcerned Veterans for America (CVA)\nConsumer Energy Alliance (CEA)\nEnergy Marketers of America (EMA)\nGPA Midstream Association\nGPSA Midstream Suppliers, Hearth\nPatio & Barbecue Association (HPBA)\nInterstate Natural Gas Association of America (INGAA)\nThe LIBRE Initiative\nNational Association of Home Builders (NAHB)\nNational Association of Oil and Energy Service Professionals (OESP)\nNational Energy and Fuels Institute (NEFI)\nNational Hispanic Energy Council\nNational Propane Gas Association (NPGA)\nPlumbing Heating Cooling Contractors – National Association (PHCC)\nPool & Hot Tub Alliance (PHTA)\nNational Ocean Industries Association (NOIA)\nEnergy Workforce and Technology Council\nPellet Fuel Institute\nAtmos Energy\nAmerican Supply Association (ASA)\nAmerica First Policy Institute (AFPI)\nFertilizer Institute\nU.S. Chamber of Commerce\nNational Federation of Independent Businesses (NFIB)\nInstitute for Legislative Analysis\nIndustrial Energy Consumers of America (IECA)\nClean Fuels Alliance\nBaker Commodities\nDigital Energy Council\nAmerican Fuel and Petrochemical Manufacturers\nIndependent Petroleum Association of America\nNational Gas Supply Association\nIssues\n:\nEnergy",
  "source": "congressional_website",
  "source_type": "press_release",
  "collected_date": "2025-12-21T14:03:43.896560",
  "verification_status": "pending",
  "archived_url": null,
  "flags": []
}