{
  "id": "e001ec281900",
  "title": "Congressman Nick Langworthy Secures $500,000 EPA Grant to Improve South Dayton Water System",
  "date": "August 26, 2025",
  "url": "https://langworthy.house.gov/media/press-releases/congressman-nick-langworthy-secures-500000-epa-grant-improve-south-dayton",
  "snippet": "Washington, D.C. –Congressman Nick Langworthy (NY-23) today announced the Environmental Protection Agency (EPA) has awarded $500,000 to the Village of South Dayton for drinking water system improvemen",
  "full_text": "August 26, 2025\nPress Release\nWashington, D.C. –\nCongressman Nick Langworthy (NY-23) today announced the Environmental Protection Agency (EPA) has awarded $500,000 to the Village of South Dayton for drinking water system improvements. This investment, delivered through the Drinking Water State Revolving Fund (STAG), is the direct result of Congressman Langworthy’s successful Community Project Funding (CPF) request for Fiscal Year 2024.\nCongressman Langworthy personally fought to secure this funding in the Consolidated Appropriations Act, 2024 (H. Res. 4366), which was signed into law in March. By delivering these resources, Langworthy is ensuring families in South Dayton have access to safe, reliable drinking water and that the village’s infrastructure is built to meet future needs.\n“I’m proud to deliver $500,000 to upgrade South Dayton’s water system,”\nsaid Congressman Langworthy.\n“This significant investment in South Dayton’s infrastructure will help modernize their stormwater collection system to protect public health. This project was one of my top priorities and since securing the funding last year, I have been pushing to get it across the finish line. I’m thrilled that it’s now a reality for the residents of South Dayton.”\n###\nIssues\n:\nGrant Announcements",
  "source": "congressional_website",
  "source_type": "press_release",
  "collected_date": "2025-12-21T14:03:48.821720",
  "verification_status": "pending",
  "archived_url": null,
  "flags": []
}