{
  "id": "ae9175349c3f",
  "title": "Congressman Nick Langworthy Blasts Hochul’s Radical Energy Ban, Highlights Growing Momentum for His Energy Choice Act in Owego and Elmira NY",
  "date": "August 29, 2025",
  "url": "https://langworthy.house.gov/media/press-releases/congressman-nick-langworthy-blasts-hochuls-radical-energy-ban-highlights-0",
  "snippet": "Washington, D.C. –Congressman Nick Langworthy (NY-23) today hosted press conferences in Owego and Elmira to spotlight the urgent need for hisEnergy Choice Act—legislation to stop extreme Democrat-led ",
  "full_text": "August 29, 2025\nPress Release\nWashington, D.C. –\nCongressman Nick Langworthy (NY-23) today hosted press conferences in Owego and Elmira to spotlight the urgent need for his\nEnergy Choice Act\n—legislation to stop extreme Democrat-led energy bans that threaten affordable, reliable options for families and businesses.\nGovernor Kathy Hochul and Albany Democrats are forcing a ban on natural gas in new construction across New York, a reckless policy that will drive up energy costs for working families, jeopardize reliable power in extreme weather, and strip New Yorkers of the right to choose how they heat and power their homes. The\nEnergy Choice Act\ndirectly pushes back on these mandates by prohibiting states and local governments from blocking energy service connections, modifications, or installations based on fuel source.\n“I am proud to lead the fight to ban the bans and defend New Yorkers’ right to affordable, reliable energy,”\nsaid Congressman Langworthy.\n“Hochul’s radical agenda will not only drive-up costs for families already struggling, but also eliminate a safe, dependable energy source that keeps homes heated and people protected. This is becoming a dangerous trend in blue states across the country, and my Energy Choice Act will end these costly bans, safeguard consumer choice, and secure America’s energy future.”\nWatch the Owego live stream here.\nWatch the Elmira live stream here.\nLangworthy was joined in strong opposition to Hochul’s energy ban by Municipal and State Legislators, as well as the Southern Tier Homebuilders Association and the Builders Exchange of the Southern Tier.\n###\nIssues\n:\nNew York State\nEnergy",
  "source": "congressional_website",
  "source_type": "press_release",
  "collected_date": "2025-12-21T14:03:46.398432",
  "verification_status": "pending",
  "archived_url": null,
  "flags": []
}